<? php

/* Ако консумацията на ток е >= 50, то 50 х 0,1 */

$C1 = 150.00;
$C2 = 155.00;
$C3 = 201.00;
$C = 302.00;

$Pr1 = 0.10;
$Pr2 = 0.15;
$Pr3 = 0.25;
$Pr4 = 0.35;

$result0 = (($C * $Pr1)+(($C * $Pr1)*0.20));
$result1 = (((50 * $Pr1) + (($C - 50) * $Pr2)) + (((50 * $Pr1) + (($C - 50) * $Pr2)) * 0.2));
$result2 = (((50 * $Pr1) + (100 * $Pr2) + (($C - 150) * $Pr3)) + (((50 * $Pr1) + (100 * $Pr2) + (($C - 150) * $Pr3))*0.2));
$result3 = (((50 * $Pr1) + (100 * $Pr2) + (100 * $Pr3) + (($C - 250) * $Pr4)) + (((50 * $Pr1) + (100 * $Pr2) + (100 * $Pr3) + (($C - 250) * $Pr4))*0.2));

if($C <= 50){
	echo $result0 . " BGN";
} elseif (($C > 50) && ($C <= 150)) {
	echo $result1 . " BGN";
} elseif (($C >= 150) && ($C < 250)) {
	echo $result2 . " BGN";
} else {
	echo $result3 . " BGN";
}

